from models.category import Category
from models.foood import Food

def get_100_thai_foods() -> List[Food]:
    foods = []
    
    # ==========================================
    # หมวดที่ 1: ข้าวจานเดียว (เมนูที่ 1 - 50)
    # ==========================================
    
    one_dish_menus = [
        "ข้าวกะเพราไก่", "ข้าวกะเพราหมู", "ข้าวกะเพราหมูกรอบ", "ข้าวกะเพราทะเล", "ข้าวกะเพราเนื้อ",
        "ข้าวกะเพราไข่เยี่ยวม้า", "ข้าวผัดหมู", "ข้าวผัดไก่", "ข้าวผัดกุ้ง", "ข้าวผัดปู",
        "ข้าวผัดทะเล", "ข้าวผัดพริกแกงหมู", "ข้าวผัดพริกแกงไก่", "ข้าวผัดพริกแกงทะเล", "ข้าวผัดน้ำพริกเผา",
        "ข้าวผัดต้มยำ", "ข้าวผัดอเมริกัน", "ข้าวหมูกระเทียม", "ข้าวไก่กระเทียม", "ข้าวกุ้งกระเทียม",
        "ข้าวหมูทอดน้ำปลา", "ข้าวหมูทอดไข่ดาว", "ข้าวหมูผัดพริกไทยดำ", "ข้าวไก่ผัดพริกไทยดำ", "ข้าวหมูผัดขิง",
        "ข้าวไก่ผัดขิง", "ข้าวหมูผัดพริกหยวก", "ข้าวไก่ผัดเม็ดมะม่วง", "ข้าวหมูผัดเปรี้ยวหวาน", "ข้าวไก่ผัดเปรี้ยวหวาน",
        "ข้าวผัดคะน้าหมูกรอบ", "ข้าวหมูแดง", "ข้าวหมูกรอบ", "ข้าวขาหมู", "ข้าวมันไก่",
        "ข้าวมันไก่ทอด", "ข้าวไข่เจียวหมูสับ", "ข้าวไข่เจียวกุ้ง", "ข้าวไข่เจียวแหนม", "ข้าวไข่ข้นกุ้ง",
        "ข้าวไข่ข้นหมู", "ข้าวไข่ข้นแฮมชีส", "ข้าวราดแกงเขียวหวานไก่", "ข้าวราดพะแนงหมู", "ข้าวราดมัสหมั่นเนื้อ",
        "ข้าวราดแกงเผ็ดเป็ดย่าง", "ข้าวราดแกงป่าไก่", "ข้าวราดผัดฉ่าทะเล", "ข้าวราดผัดเผ็ดหมูป่า", "ข้าวปลาหมึกผัดไข่เค็ม"
    ]
    for menu in one_dish_menus:
        foods.append(Food(nameTh=menu, category=Category.ONE_DISH))
    
    # ==========================================
    # หมวดที่ 2: เมนูเส้น (เมนูที่ 51 - 76)
    # ==========================================
    
    noodle_menus = [
    "ผัดไทย", "ผัดไทยกุ้งสด", "ผัดซีอิ๊วหมู", "ผัดซีอิ๊วไก่", "ผัดซีอิ๊วทะเล",
        "ราดหน้าหมู", "ราดหน้าไก่", "ราดหน้าทะเล", "ก๋วยเตี๋ยวคั่วไก่", "ก๋วยเตี๋ยวคั่วทะเล",
        "มาม่าผัดขี้เมา", "มาม่าผัดต้มยำ", "สุกี้แห้งหมู", "สุกี้แห้งทะเล", "สุกี้น้ำหมู",
        "สุกี้น้ำไก่", "เส้นใหญ่ผัดซีอิ๊ว", "เส้นหมี่ผัดซีอิ๊ว", "เส้นหมี่ผัดกระเฉด", "ผัดหมี่ซั่ว",
        "วุ้นเส้นผัดไข่", "ตำเส้นเล็ก", "ตำซั่ว", "ยำขนมจีน", "ยำวุ้นเส้น", "ยำมาม่า"
    ]
    for menu in noodle_menus:
        foods.append(Food(nameTh=menu, category=Category.NOODLE))


    soup_curry_menus = [
        "ต้มยำกุ้ง", "ต้มยำรวมมิตร", "ต้มแซ่บกระดูกอ่อน", "ต้มจืดเต้าหู้หมูสับ", "ต้มจืดวุ้นเส้น",
        "แกงจืดตำลึงหมูสับ", "แกงเขียวหวานไก่", "แกงพะแนงหมู", "แกงมัสหมั่นเนื้อ", "แกงส้มชะอมไข่",
        "แกงส้มแป๊ะซะ", "แกงป่าหมู", "แกงเลียงกุ้งสด", "แกงเผ็ดหมู", "แกงคั่วหอยขม",
        "แกงไตปลา", "ไข่ตุ๋น", "ไข่พะโล้", "คอหมูย่างน้ำจิ้มแจ่ว", "ไก่ทอดเกลือ",
        "หมูสามชั้นทอดน้ำปลา", "หมูกรอบผัดพริกเกลือ", "หมูสับผัดไข่เค็ม", "กุ้งผัดผงกะหรี่"
    ]
    
    for menu in soup_curry_menus:
        foods.append(Food(nameTH=menu, category=Category.SOUP_CURRY))
        
    return foods